configuration/src/InformationRegisters/ОчередьСравненияИзмененийОписанийОбъектов/ОчередьСравненияИзмененийОписанийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьСравненияИзмененийОписанийОбъектов</name>
  <resources>
    <name>НовоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СтароеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектИсторииИзменений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОписания</name>
    <type>
      <types>EnumRef.ВидыОписания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОчередьСравненияИзмененийОписанийОбъектов/Forms/ФормаЗаписи/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьСравненияИзмененийОписанийОбъектов.СтароеОписание КАК СтароеОписание,
	|	ОчередьСравненияИзмененийОписанийОбъектов.НовоеОписание КАК НовоеОписание
	|ИЗ
	|	РегистрСведений.ОчередьСравненияИзмененийОписанийОбъектов КАК ОчередьСравненияИзмененийОписанийОбъектов
	|ГДЕ
	|	ОчередьСравненияИзмененийОписанийОбъектов.Обработано = &Обработано
	|	И ОчередьСравненияИзмененийОписанийОбъектов.Объект = &Объект
	|	И ОчередьСравненияИзмененийОписанийОбъектов.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Обработано", Запись.Обработано);
	Запрос.УстановитьПараметр("Объект", Запись.Объект);
	Запрос.УстановитьПараметр("Дата", Запись.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ОписаниеДо = Выборка.СтароеОписание.Получить();
	ОписаниеПосле = Выборка.НовоеОписание.Получить();
	
КонецПроцедуры
